/**************************************************************
*	版本信息:	2013.3.16(lnk)
*	文件名称:	cGame.cpp
*	内容摘要:
*			蛇类的实现
*	历史记录:
*			人物			时间			操作
*			lnk				2013.3.16		create
***************************************************************/
#include "cGame.h"

/**************************************************************
*	函数名称: GameInit
*	函数功能:
*		游戏初始化
*	参数列表:
*		无
*	返 回 值:
*		无
*	历史记录:
*		2013.3.16	created by lnk
****************************************************************/
void cGame::GameInit()
{
	closegraph();
	initgraph(800,600);
	setbkmode(TRANSPARENT);					//设置输出文字背景为透明
	LOGFONT f;
	getfont(&f);							// 获取当前字体设置
	f.lfHeight = 50;						// 设置字体高度为 48（包含行距）
	_tcscpy(f.lfFaceName, _T("黑体"));		// 设置字体为“黑体”
	f.lfQuality = ANTIALIASED_QUALITY;		// 设置输出效果为抗锯齿  
	setfont(&f);							// 设置字体样式
}

/**************************************************************
*	函数名称: GameWin
*	函数功能:
*		游戏赢
*	参数列表:
*		无
*	返 回 值:
*		无
*	历史记录:
*		2013.3.16	created by lnk
****************************************************************/
void cGame::GameWin()
{
	setcolor(RED);
	setfont(70, 0, _T("微软雅黑"));
	outtextxy(150, 265, _T("YOU WIN!"));
	FlushBatchDraw();
	Sleep(10000);
	exit(0);
}

/**************************************************************
*	函数名称: GameFail
*	函数功能:
*		游戏输
*	参数列表:
*		无
*	返 回 值:
*		无
*	历史记录:
*		2013.3.16	created by lnk
****************************************************************/
void cGame::GameFail()
{
	setcolor(RED);
	setfont(70, 0, _T("微软雅黑"));
	outtextxy(150, 265, _T("YOU LOSE!"));
}